[Timeout] BlockStatement
backend/src/controllers/AddressController.js:4:36
 const connection = require('../database')
 
 module.exports = {
-    async index(request, response) {
-        const addresses = await connection('addresses').select('*')
-
-        return response.json({ msg: addresses });
-    },
+    async index(request, response) {},
     async show(request, response) {
         const { id } = request.params

[Killed] ObjectLiteral
backend/src/controllers/AddressController.js:7:30
     async index(request, response) {
         const addresses = await connection('addresses').select('*')
 
-        return response.json({ msg: addresses });
+        return response.json({});
     },
     async show(request, response) {

[Survived] BlockStatement
backend/src/controllers/AddressController.js:9:35
 
         return response.json({ msg: addresses });
     },
-    async show(request, response) {
-        const { id } = request.params
-
-        const [address] = await connection('addresses').where('id', id).select()
-
-        return response.status(200).json({ msg: address })
-    },
+    async show(request, response) {},
     async store(request, response) {
         const { physicianId, type, zipcode, state, city, district, street, number } = request.body;

[Survived] BlockStatement
backend/src/controllers/AddressController.js:16:36
 
         return response.status(200).json({ msg: address })
     },
-    async store(request, response) {
-        const { physicianId, type, zipcode, state, city, district, street, number } = request.body;
-
-        const [id] = await connection('addresses').insert({
-            physicianId,
-            type,
-            zipcode,
-            state,
-            city,
-            district,
-            street,
-            number
-        })
-
-        return response.status(201).json({ msg: { id, physicianId, type, zipcode, state, city, district, street, number } })
-    },
+    async store(request, response) {},
     async update(request, response) {
         const { id } = request.params

[Survived] StringLiteral
backend/src/controllers/AddressController.js:19:39
     async store(request, response) {
         const { physicianId, type, zipcode, state, city, district, street, number } = request.body;
 
-        const [id] = await connection('addresses').insert({
+        const [id] = await connection("").insert({
             physicianId,
             type,

[Survived] BlockStatement
backend/src/controllers/AddressController.js:32:37
 
         return response.status(201).json({ msg: { id, physicianId, type, zipcode, state, city, district, street, number } })
     },
-    async update(request, response) {
-        const { id } = request.params
-
-        const { physicianId, type, zipcode, state, city, district, street, number } = request.body;
-
-        const address = await connection('addresses')
-            .where('id', id)
-            .update({
-                physicianId,
-                type,
-                zipcode,
-                state,
-                city,
-                district,
-                street,
-                number
-            })
-
-        if (address === 0) {
-            return response.status(406).json({ error: 'address not updated!' })
-        }
-
-        return response.status(200).json({ msg: { id, physicianId, type, zipcode, state, city, district, street, number } })
-    },
+    async update(request, response) {},
     async destroy(request, response) {
         const { id } = request.params

[Survived] ConditionalExpression
backend/src/controllers/AddressController.js:50:13
                 number
             })
 
-        if (address === 0) {
+        if (true) {
             return response.status(406).json({ error: 'address not updated!' })
         }

[Survived] BlockStatement
backend/src/controllers/AddressController.js:50:28
                 number
             })
 
-        if (address === 0) {
-            return response.status(406).json({ error: 'address not updated!' })
-        }
+        if (address === 0) {}
 
         return response.status(200).json({ msg: { id, physicianId, type, zipcode, state, city, district, street, number } })

[Survived] StringLiteral
backend/src/controllers/AddressController.js:51:55
             })
 
         if (address === 0) {
-            return response.status(406).json({ error: 'address not updated!' })
+            return response.status(406).json({ error: "" })
         }
 

[Survived] BlockStatement
backend/src/controllers/AddressController.js:56:38
 
         return response.status(200).json({ msg: { id, physicianId, type, zipcode, state, city, district, street, number } })
     },
-    async destroy(request, response) {
-        const { id } = request.params
-
-        const address = await connection('addresses').where('id', id).delete()
-
-        if (address === 0) {
-            return response.status(406).json({ error: 'address not found!' })
-        }
-
-        return response.status(204).send()
-    }
+    async destroy(request, response) {}
 }
 

[Survived] EqualityOperator
backend/src/controllers/AddressController.js:61:13
 
         const address = await connection('addresses').where('id', id).delete()
 
-        if (address === 0) {
+        if (address !== 0) {
             return response.status(406).json({ error: 'address not found!' })
         }

[Survived] BlockStatement
backend/src/controllers/AddressController.js:61:28
 
         const address = await connection('addresses').where('id', id).delete()
 
-        if (address === 0) {
-            return response.status(406).json({ error: 'address not found!' })
-        }
+        if (address === 0) {}
 
         return response.status(204).send()

[Survived] ObjectLiteral
backend/src/controllers/AddressController.js:62:46
         const address = await connection('addresses').where('id', id).delete()
 
         if (address === 0) {
-            return response.status(406).json({ error: 'address not found!' })
+            return response.status(406).json({})
         }
 
