[Timeout] BlockStatement
backend/src/controllers/ContactController.js:4:36
 const connection = require('../database')
 
 module.exports = {
-    async index(request, response) {
-        const contacts = await connection('contacts').select('*')
-
-        return response.json({ msg: contacts });
-    },
+    async index(request, response) {},
     async show(request, response) {
         const { id } = request.params

[Survived] StringLiteral
backend/src/controllers/ContactController.js:5:62
 
 module.exports = {
     async index(request, response) {
-        const contacts = await connection('contacts').select('*')
+        const contacts = await connection('contacts').select("")
 
         return response.json({ msg: contacts });

[Timeout] BlockStatement
backend/src/controllers/ContactController.js:9:35
 
         return response.json({ msg: contacts });
     },
-    async show(request, response) {
-        const { id } = request.params
-
-        const [contact] = await connection('contacts').where('id', id).select()
-
-        return response.status(200).json({ msg: contact })
-    },
+    async show(request, response) {},
     async store(request, response) {
         const { physicianId, type, contact } = request.body;

[Killed] StringLiteral
backend/src/controllers/ContactController.js:12:62
     async show(request, response) {
         const { id } = request.params
 
-        const [contact] = await connection('contacts').where('id', id).select()
+        const [contact] = await connection('contacts').where("", id).select()
 
         return response.status(200).json({ msg: contact })

[Timeout] BlockStatement
backend/src/controllers/ContactController.js:16:36
 
         return response.status(200).json({ msg: contact })
     },
-    async store(request, response) {
-        const { physicianId, type, contact } = request.body;
-
-        const [id] = await connection('contacts').insert({
-            physicianId,
-            type,
-            contact
-        })
-
-        return response.status(201).json({ msg: { id, physicianId, type, contact } })
-    },
+    async store(request, response) {},
     async update(request, response) {
         const { id } = request.params

[Timeout] ObjectLiteral
backend/src/controllers/ContactController.js:19:58
     async store(request, response) {
         const { physicianId, type, contact } = request.body;
 
-        const [id] = await connection('contacts').insert({
-            physicianId,
-            type,
-            contact
-        })
+        const [id] = await connection('contacts').insert({})
 
         return response.status(201).json({ msg: { id, physicianId, type, contact } })

[Timeout] ObjectLiteral
backend/src/controllers/ContactController.js:25:49
             contact
         })
 
-        return response.status(201).json({ msg: { id, physicianId, type, contact } })
+        return response.status(201).json({ msg: {} })
     },
     async update(request, response) {

[Timeout] BlockStatement
backend/src/controllers/ContactController.js:27:37
 
         return response.status(201).json({ msg: { id, physicianId, type, contact } })
     },
-    async update(request, response) {
-        const { id } = request.params
-
-        const { physicianId, type, contact } = request.body;
-
-        const result = await connection('contacts')
-            .where('id', id)
-            .update({
-                physicianId,
-                type,
-                contact
-            })
-
-        if (result === 0) {
-            return response.status(406).json({ error: 'contact not updated!' })
-        }
-
-        return response.status(200).json({ msg: { id, physicianId, type, contact } })
-    },
+    async update(request, response) {},
     async destroy(request, response) {
         const { id } = request.params

[Killed] StringLiteral
backend/src/controllers/ContactController.js:32:41
 
         const { physicianId, type, contact } = request.body;
 
-        const result = await connection('contacts')
+        const result = await connection("")
             .where('id', id)
             .update({

[Timeout] StringLiteral
backend/src/controllers/ContactController.js:33:20
         const { physicianId, type, contact } = request.body;
 
         const result = await connection('contacts')
-            .where('id', id)
+            .where("", id)
             .update({
                 physicianId,

[Killed] EqualityOperator
backend/src/controllers/ContactController.js:40:13
                 contact
             })
 
-        if (result === 0) {
+        if (result !== 0) {
             return response.status(406).json({ error: 'contact not updated!' })
         }

[Survived] ConditionalExpression
backend/src/controllers/ContactController.js:40:13
                 contact
             })
 
-        if (result === 0) {
+        if (false) {
             return response.status(406).json({ error: 'contact not updated!' })
         }

[Survived] ObjectLiteral
backend/src/controllers/ContactController.js:41:46
             })
 
         if (result === 0) {
-            return response.status(406).json({ error: 'contact not updated!' })
+            return response.status(406).json({})
         }
 

[Killed] BlockStatement
backend/src/controllers/ContactController.js:46:38
 
         return response.status(200).json({ msg: { id, physicianId, type, contact } })
     },
-    async destroy(request, response) {
-        const { id } = request.params
-
-        const result = await connection('contacts').where('id', id).delete()
-
-        if (result === 0) {
-            return response.status(406).json({ error: 'contact not found!' })
-        }
-
-        return response.status(204).send()
-    }
+    async destroy(request, response) {}
 }
 

[Killed] StringLiteral
backend/src/controllers/ContactController.js:49:41
     async destroy(request, response) {
         const { id } = request.params
 
-        const result = await connection('contacts').where('id', id).delete()
+        const result = await connection("").where('id', id).delete()
 
         if (result === 0) {

[Killed] ConditionalExpression
backend/src/controllers/ContactController.js:51:13
 
         const result = await connection('contacts').where('id', id).delete()
 
-        if (result === 0) {
+        if (true) {
             return response.status(406).json({ error: 'contact not found!' })
         }

[Survived] ObjectLiteral
backend/src/controllers/ContactController.js:52:46
         const result = await connection('contacts').where('id', id).delete()
 
         if (result === 0) {
-            return response.status(406).json({ error: 'contact not found!' })
+            return response.status(406).json({})
         }
 
