[Survived] BlockStatement
backend/src/controllers/PhysicianController.js:4:36
 const connection = require('../database')
 
 module.exports = {
-    async index(request, response) {
-        const physicians = await connection('physicians').select('*')
-
-        return response.json({ msg: physicians });
-    },
+    async index(request, response) {},
     async show(request, response) {
         const { id } = request.params

[Survived] StringLiteral
backend/src/controllers/PhysicianController.js:5:45
 
 module.exports = {
     async index(request, response) {
-        const physicians = await connection('physicians').select('*')
+        const physicians = await connection("").select('*')
 
         return response.json({ msg: physicians });

[Killed] BlockStatement
backend/src/controllers/PhysicianController.js:9:35
 
         return response.json({ msg: physicians });
     },
-    async show(request, response) {
-        const { id } = request.params
-
-        const [physician] = await connection('physicians').where('id', id).select()
-
-        return response.status(200).json({ msg: physician })
-    },
+    async show(request, response) {},
     async store(request, response) {
         const { name, crm, cpf } = request.body;

[Timeout] BlockStatement
backend/src/controllers/PhysicianController.js:16:36
 
         return response.status(200).json({ msg: physician })
     },
-    async store(request, response) {
-        const { name, crm, cpf } = request.body;
-
-        const [id] = await connection('physicians').insert({
-            name,
-            crm,
-            cpf
-        })
-
-        return response.status(201).json({ msg: { id, name, crm, cpf } })
-    },
+    async store(request, response) {},
     async update(request, response) {
         const { id } = request.params

[Timeout] ObjectLiteral
backend/src/controllers/PhysicianController.js:19:60
     async store(request, response) {
         const { name, crm, cpf } = request.body;
 
-        const [id] = await connection('physicians').insert({
-            name,
-            crm,
-            cpf
-        })
+        const [id] = await connection('physicians').insert({})
 
         return response.status(201).json({ msg: { id, name, crm, cpf } })

[Timeout] ObjectLiteral
backend/src/controllers/PhysicianController.js:25:49
             cpf
         })
 
-        return response.status(201).json({ msg: { id, name, crm, cpf } })
+        return response.status(201).json({ msg: {} })
     },
     async update(request, response) {

[Killed] BlockStatement
backend/src/controllers/PhysicianController.js:27:37
 
         return response.status(201).json({ msg: { id, name, crm, cpf } })
     },
-    async update(request, response) {
-        const { id } = request.params
-
-        const { name, crm, cpf } = request.body;
-
-        const physician = await connection('physicians')
-            .where('id', id)
-            .update({
-                name,
-                crm,
-                cpf
-            })
-
-        if (physician === 0) {
-            return response.status(406).json({ error: 'Physician not updated!' })
-        }
-
-        return response.status(200).json({ msg: { id, name, crm, cpf } })
-    },
+    async update(request, response) {},
     async destroy(request, response) {
         const { id } = request.params

[Killed] StringLiteral
backend/src/controllers/PhysicianController.js:33:20
         const { name, crm, cpf } = request.body;
 
         const physician = await connection('physicians')
-            .where('id', id)
+            .where("", id)
             .update({
                 name,

[Killed] ConditionalExpression
backend/src/controllers/PhysicianController.js:40:13
                 cpf
             })
 
-        if (physician === 0) {
+        if (true) {
             return response.status(406).json({ error: 'Physician not updated!' })
         }

[Killed] EqualityOperator
backend/src/controllers/PhysicianController.js:40:13
                 cpf
             })
 
-        if (physician === 0) {
+        if (physician !== 0) {
             return response.status(406).json({ error: 'Physician not updated!' })
         }

[Survived] BlockStatement
backend/src/controllers/PhysicianController.js:46:38
 
         return response.status(200).json({ msg: { id, name, crm, cpf } })
     },
-    async destroy(request, response) {
-        const { id } = request.params
-
-        const physician = await connection('physicians').where('id', id).delete()
-
-        if (physician === 0) {
-            return response.status(406).json({ error: 'Physician not found!' })
-        }
-
-        return response.status(204).send()
-    }
+    async destroy(request, response) {}
 }
 

[Survived] StringLiteral
backend/src/controllers/PhysicianController.js:49:64
     async destroy(request, response) {
         const { id } = request.params
 
-        const physician = await connection('physicians').where('id', id).delete()
+        const physician = await connection('physicians').where("", id).delete()
 
         if (physician === 0) {

[Survived] BlockStatement
backend/src/controllers/PhysicianController.js:51:30
 
         const physician = await connection('physicians').where('id', id).delete()
 
-        if (physician === 0) {
-            return response.status(406).json({ error: 'Physician not found!' })
-        }
+        if (physician === 0) {}
 
         return response.status(204).send()

[Survived] ConditionalExpression
backend/src/controllers/PhysicianController.js:51:13
 
         const physician = await connection('physicians').where('id', id).delete()
 
-        if (physician === 0) {
+        if (false) {
             return response.status(406).json({ error: 'Physician not found!' })
         }
