[Timeout] BlockStatement
backend/src/controllers/PhysicianSpecialtyController.js:4:36
 const connection = require('../database')
 
 module.exports = {
-    async index(request, response) {
-        const physicianSpecialties = await connection('physician_specialties').select('*')
-
-        return response.json({ msg: physicianSpecialties });
-    },
+    async index(request, response) {},
     async show(request, response) {
         const { id } = request.params

[Killed] ObjectLiteral
backend/src/controllers/PhysicianSpecialtyController.js:7:30
     async index(request, response) {
         const physicianSpecialties = await connection('physician_specialties').select('*')
 
-        return response.json({ msg: physicianSpecialties });
+        return response.json({});
     },
     async show(request, response) {

[Timeout] BlockStatement
backend/src/controllers/PhysicianSpecialtyController.js:9:35
 
         return response.json({ msg: physicianSpecialties });
     },
-    async show(request, response) {
-        const { id } = request.params
-
-        const [physicianSpecialty] = await connection('physician_specialties').where('id', id).select()
-
-        return response.status(200).json({ msg: physicianSpecialty })
-    },
+    async show(request, response) {},
     async store(request, response) {
         const { physicianId, specialtiesId } = request.body;

[Killed] StringLiteral
backend/src/controllers/PhysicianSpecialtyController.js:12:86
     async show(request, response) {
         const { id } = request.params
 
-        const [physicianSpecialty] = await connection('physician_specialties').where('id', id).select()
+        const [physicianSpecialty] = await connection('physician_specialties').where("", id).select()
 
         return response.status(200).json({ msg: physicianSpecialty })

[Killed] ObjectLiteral
backend/src/controllers/PhysicianSpecialtyController.js:14:42
 
         const [physicianSpecialty] = await connection('physician_specialties').where('id', id).select()
 
-        return response.status(200).json({ msg: physicianSpecialty })
+        return response.status(200).json({})
     },
     async store(request, response) {

[Timeout] BlockStatement
backend/src/controllers/PhysicianSpecialtyController.js:16:36
 
         return response.status(200).json({ msg: physicianSpecialty })
     },
-    async store(request, response) {
-        const { physicianId, specialtiesId } = request.body;
-
-        const [id] = await connection('physician_specialties').insert({
-            physicianId,
-            specialtiesId
-        })
-
-        return response.status(201).json({ msg: { id, physicianId, specialtiesId } })
-    },
+    async store(request, response) {},
     async update(request, response) {
         const { id } = request.params

[Timeout] StringLiteral
backend/src/controllers/PhysicianSpecialtyController.js:19:39
     async store(request, response) {
         const { physicianId, specialtiesId } = request.body;
 
-        const [id] = await connection('physician_specialties').insert({
+        const [id] = await connection("").insert({
             physicianId,
             specialtiesId

[Survived] BlockStatement
backend/src/controllers/PhysicianSpecialtyController.js:26:37
 
         return response.status(201).json({ msg: { id, physicianId, specialtiesId } })
     },
-    async update(request, response) {
-        const { id } = request.params
-
-        const { physicianId, specialtiesId } = request.body;
-
-        const physicianSpecialty = await connection('physician_specialties')
-            .where('id', id)
-            .update({
-                physicianId,
-                specialtiesId
-            })
-
-        if (physician_specialty === 0) {
-            return response.status(406).json({ error: 'physician_specialty not updated!' })
-        }
-
-        return response.status(200).json({ msg: { id, physicianId, specialtiesId } })
-    },
+    async update(request, response) {},
     async destroy(request, response) {
         const { id } = request.params

[Survived] BlockStatement
backend/src/controllers/PhysicianSpecialtyController.js:38:40
                 specialtiesId
             })
 
-        if (physician_specialty === 0) {
-            return response.status(406).json({ error: 'physician_specialty not updated!' })
-        }
+        if (physician_specialty === 0) {}
 
         return response.status(200).json({ msg: { id, physicianId, specialtiesId } })

[Survived] ConditionalExpression
backend/src/controllers/PhysicianSpecialtyController.js:38:13
                 specialtiesId
             })
 
-        if (physician_specialty === 0) {
+        if (false) {
             return response.status(406).json({ error: 'physician_specialty not updated!' })
         }

[Survived] ObjectLiteral
backend/src/controllers/PhysicianSpecialtyController.js:39:46
             })
 
         if (physician_specialty === 0) {
-            return response.status(406).json({ error: 'physician_specialty not updated!' })
+            return response.status(406).json({})
         }
 

[Survived] ObjectLiteral
backend/src/controllers/PhysicianSpecialtyController.js:42:42
             return response.status(406).json({ error: 'physician_specialty not updated!' })
         }
 
-        return response.status(200).json({ msg: { id, physicianId, specialtiesId } })
+        return response.status(200).json({})
     },
     async destroy(request, response) {

[Timeout] BlockStatement
backend/src/controllers/PhysicianSpecialtyController.js:44:38
 
         return response.status(200).json({ msg: { id, physicianId, specialtiesId } })
     },
-    async destroy(request, response) {
-        const { id } = request.params
-
-        const physicianSpecialty = await connection('physician_specialties').where('id', id).delete()
-
-        if (physicianSpecialty === 0) {
-            return response.status(406).json({ error: 'physician_specialty not found!' })
-        }
-
-        return response.status(204).send()
-    }
+    async destroy(request, response) {}
 }
 

[Killed] StringLiteral
backend/src/controllers/PhysicianSpecialtyController.js:47:84
     async destroy(request, response) {
         const { id } = request.params
 
-        const physicianSpecialty = await connection('physician_specialties').where('id', id).delete()
+        const physicianSpecialty = await connection('physician_specialties').where("", id).delete()
 
         if (physicianSpecialty === 0) {

[Killed] EqualityOperator
backend/src/controllers/PhysicianSpecialtyController.js:49:13
 
         const physicianSpecialty = await connection('physician_specialties').where('id', id).delete()
 
-        if (physicianSpecialty === 0) {
+        if (physicianSpecialty !== 0) {
             return response.status(406).json({ error: 'physician_specialty not found!' })
         }

[Killed] ConditionalExpression
backend/src/controllers/PhysicianSpecialtyController.js:49:13
 
         const physicianSpecialty = await connection('physician_specialties').where('id', id).delete()
 
-        if (physicianSpecialty === 0) {
+        if (true) {
             return response.status(406).json({ error: 'physician_specialty not found!' })
         }

[Survived] ObjectLiteral
backend/src/controllers/PhysicianSpecialtyController.js:50:46
         const physicianSpecialty = await connection('physician_specialties').where('id', id).delete()
 
         if (physicianSpecialty === 0) {
-            return response.status(406).json({ error: 'physician_specialty not found!' })
+            return response.status(406).json({})
         }
 
