[Survived] BlockStatement
backend/src/controllers/ProfileController.js:4:36
 const connection = require('../database')
 
 module.exports = {
-    async index(request, response) {
-        const results = await connection('physicians').select('*')
-
-        return response.json({ msg: results });
-    },
+    async index(request, response) {},
 
     async show(request, response) {

[Survived] StringLiteral
backend/src/controllers/ProfileController.js:5:63
 
 module.exports = {
     async index(request, response) {
-        const results = await connection('physicians').select('*')
+        const results = await connection('physicians').select("")
 
         return response.json({ msg: results });

[Survived] StringLiteral
backend/src/controllers/ProfileController.js:5:42
 
 module.exports = {
     async index(request, response) {
-        const results = await connection('physicians').select('*')
+        const results = await connection("").select('*')
 
         return response.json({ msg: results });

[Survived] ObjectLiteral
backend/src/controllers/ProfileController.js:7:30
     async index(request, response) {
         const results = await connection('physicians').select('*')
 
-        return response.json({ msg: results });
+        return response.json({});
     },
 

[Survived] BlockStatement
backend/src/controllers/ProfileController.js:10:35
         return response.json({ msg: results });
     },
 
-    async show(request, response) {
-        const { id } = request.params
-
-        const [physician] = await connection('physicians').where('id', id).select()
-
-        const addresses = await connection('addresses').where('physicianId', id).select()
-
-        const contacts = await connection('contacts').where('physicianId', id).select()
-
-        const specialties = await connection('physician_specialties')
-            .join('specialties', 'specialties.id', '=', 'physician_specialties.specialtiesId')
-            .where('physicianId', id)
-            .select([
-                'physician_specialties.*',
-                'specialties.name'
-            ])
-
-        return response.status(200).json({ msg: { physician, addresses, contacts, specialties } })
-    },
+    async show(request, response) {},
     async store(request, response) {
         return response.json({ msg: 'Hello World!' });

[Survived] StringLiteral
backend/src/controllers/ProfileController.js:17:61
 
         const addresses = await connection('addresses').where('physicianId', id).select()
 
-        const contacts = await connection('contacts').where('physicianId', id).select()
+        const contacts = await connection('contacts').where("", id).select()
 
         const specialties = await connection('physician_specialties')

[Survived] StringLiteral
backend/src/controllers/ProfileController.js:20:57
         const contacts = await connection('contacts').where('physicianId', id).select()
 
         const specialties = await connection('physician_specialties')
-            .join('specialties', 'specialties.id', '=', 'physician_specialties.specialtiesId')
+            .join('specialties', 'specialties.id', '=', "")
             .where('physicianId', id)
             .select([

[Survived] StringLiteral
backend/src/controllers/ProfileController.js:24:17
             .where('physicianId', id)
             .select([
                 'physician_specialties.*',
-                'specialties.name'
+                ""
             ])
 

[Survived] ObjectLiteral
backend/src/controllers/ProfileController.js:27:42
                 'specialties.name'
             ])
 
-        return response.status(200).json({ msg: { physician, addresses, contacts, specialties } })
+        return response.status(200).json({})
     },
     async store(request, response) {

[Survived] ObjectLiteral
backend/src/controllers/ProfileController.js:27:49
                 'specialties.name'
             ])
 
-        return response.status(200).json({ msg: { physician, addresses, contacts, specialties } })
+        return response.status(200).json({ msg: {} })
     },
     async store(request, response) {

[Survived] BlockStatement
backend/src/controllers/ProfileController.js:29:36
 
         return response.status(200).json({ msg: { physician, addresses, contacts, specialties } })
     },
-    async store(request, response) {
-        return response.json({ msg: 'Hello World!' });
-    },
+    async store(request, response) {},
     async update(request, response) {
         return response.json({ msg: 'Hello World!' });

[Survived] BlockStatement
backend/src/controllers/ProfileController.js:32:37
     async store(request, response) {
         return response.json({ msg: 'Hello World!' });
     },
-    async update(request, response) {
-        return response.json({ msg: 'Hello World!' });
-    },
+    async update(request, response) {},
     async destroy(request, response) {
         return response.json({ msg: 'Hello World!' });

[Survived] ObjectLiteral
backend/src/controllers/ProfileController.js:33:30
         return response.json({ msg: 'Hello World!' });
     },
     async update(request, response) {
-        return response.json({ msg: 'Hello World!' });
+        return response.json({});
     },
     async destroy(request, response) {

[Survived] BlockStatement
backend/src/controllers/ProfileController.js:35:38
     async update(request, response) {
         return response.json({ msg: 'Hello World!' });
     },
-    async destroy(request, response) {
-        return response.json({ msg: 'Hello World!' });
-    }
+    async destroy(request, response) {}
 }
 
