[Survived] BlockStatement
backend/src/controllers/SpecialtyController.js:4:36
 const connection = require('../database')
 
 module.exports = {
-    async index(request, response) {
-        const specialties = await connection('specialties').select('*')
-
-        return response.json({ msg: specialties });
-    },
+    async index(request, response) {},
     async show(request, response) {
         const { id } = request.params

[Survived] ObjectLiteral
backend/src/controllers/SpecialtyController.js:7:30
     async index(request, response) {
         const specialties = await connection('specialties').select('*')
 
-        return response.json({ msg: specialties });
+        return response.json({});
     },
     async show(request, response) {

[Killed] BlockStatement
backend/src/controllers/SpecialtyController.js:9:35
 
         return response.json({ msg: specialties });
     },
-    async show(request, response) {
-        const { id } = request.params
-
-        const [specialty] = await connection('specialties').where('id', id).select()
-
-        return response.status(200).json({ msg: specialty })
-    },
+    async show(request, response) {},
     async store(request, response) {
         const { name } = request.body;

[Killed] StringLiteral
backend/src/controllers/SpecialtyController.js:12:46
     async show(request, response) {
         const { id } = request.params
 
-        const [specialty] = await connection('specialties').where('id', id).select()
+        const [specialty] = await connection("").where('id', id).select()
 
         return response.status(200).json({ msg: specialty })

[Killed] ObjectLiteral
backend/src/controllers/SpecialtyController.js:14:42
 
         const [specialty] = await connection('specialties').where('id', id).select()
 
-        return response.status(200).json({ msg: specialty })
+        return response.status(200).json({})
     },
     async store(request, response) {

[Timeout] BlockStatement
backend/src/controllers/SpecialtyController.js:16:36
 
         return response.status(200).json({ msg: specialty })
     },
-    async store(request, response) {
-        const { name } = request.body;
-
-        const [id] = await connection('specialties').insert({
-            name
-        })
-
-        return response.status(201).json({ msg: { id, name } })
-    },
+    async store(request, response) {},
     async update(request, response) {
         const { id } = request.params

[Timeout] ObjectLiteral
backend/src/controllers/SpecialtyController.js:23:49
             name
         })
 
-        return response.status(201).json({ msg: { id, name } })
+        return response.status(201).json({ msg: {} })
     },
     async update(request, response) {

[Killed] BlockStatement
backend/src/controllers/SpecialtyController.js:25:37
 
         return response.status(201).json({ msg: { id, name } })
     },
-    async update(request, response) {
-        const { id } = request.params
-
-        const { name } = request.body;
-
-        const specialty = await connection('specialties')
-            .where('id', id)
-            .update({
-                name
-            })
-
-        if (specialty === 0) {
-            return response.status(406).json({ error: 'specialty not updated!' })
-        }
-
-        return response.status(200).json({ msg: { id, name } })
-    },
+    async update(request, response) {},
     async destroy(request, response) {
         const { id } = request.params

[Killed] EqualityOperator
backend/src/controllers/SpecialtyController.js:36:13
                 name
             })
 
-        if (specialty === 0) {
+        if (specialty !== 0) {
             return response.status(406).json({ error: 'specialty not updated!' })
         }

[Killed] ConditionalExpression
backend/src/controllers/SpecialtyController.js:36:13
                 name
             })
 
-        if (specialty === 0) {
+        if (true) {
             return response.status(406).json({ error: 'specialty not updated!' })
         }

[Killed] ObjectLiteral
backend/src/controllers/SpecialtyController.js:40:42
             return response.status(406).json({ error: 'specialty not updated!' })
         }
 
-        return response.status(200).json({ msg: { id, name } })
+        return response.status(200).json({})
     },
     async destroy(request, response) {

[Survived] BlockStatement
backend/src/controllers/SpecialtyController.js:42:38
 
         return response.status(200).json({ msg: { id, name } })
     },
-    async destroy(request, response) {
-        const { id } = request.params
-
-        const specialty = await connection('specialties').where('id', id).delete()
-
-        if (specialty === 0) {
-            return response.status(406).json({ error: 'specialty not found!' })
-        }
-
-        return response.status(204).send()
-    }
+    async destroy(request, response) {}
 }
 
