[Survived] BlockStatement
src/database/migrations/20200410210056_create_physicians.js:2:30
 
-exports.up = function (knex) {
-    return knex.schema.createTable('physicians', function (table) {
-        table.increments('id').primary()
-        table.string('name').notNullable()
-        table.string('crm').notNullable()
-        table.string('cpf', 11).notNullable()
-        table.boolean('status').notNullable().defaultTo(true)
-    })
-}
+exports.up = function (knex) {}
 
 exports.down = function (knex) {

[Survived] BlockStatement
src/database/migrations/20200410210056_create_physicians.js:3:67
 
 exports.up = function (knex) {
-    return knex.schema.createTable('physicians', function (table) {
-        table.increments('id').primary()
-        table.string('name').notNullable()
-        table.string('crm').notNullable()
-        table.string('cpf', 11).notNullable()
-        table.boolean('status').notNullable().defaultTo(true)
-    })
+    return knex.schema.createTable('physicians', function (table) {})
 }
 

[Survived] StringLiteral
src/database/migrations/20200410210056_create_physicians.js:3:36
 
 exports.up = function (knex) {
-    return knex.schema.createTable('physicians', function (table) {
+    return knex.schema.createTable("", function (table) {
         table.increments('id').primary()
         table.string('name').notNullable()

[Survived] StringLiteral
src/database/migrations/20200410210056_create_physicians.js:7:22
         table.increments('id').primary()
         table.string('name').notNullable()
         table.string('crm').notNullable()
-        table.string('cpf', 11).notNullable()
+        table.string("", 11).notNullable()
         table.boolean('status').notNullable().defaultTo(true)
     })

[Survived] BooleanLiteral
src/database/migrations/20200410210056_create_physicians.js:8:57
         table.string('name').notNullable()
         table.string('crm').notNullable()
         table.string('cpf', 11).notNullable()
-        table.boolean('status').notNullable().defaultTo(true)
+        table.boolean('status').notNullable().defaultTo(false)
     })
 }

[Survived] BlockStatement
src/database/migrations/20200410210056_create_physicians.js:12:32
     })
 }
 
-exports.down = function (knex) {
-    return knex.schema.dropTable('physicians')
-}
+exports.down = function (knex) {}
 
