[Survived] BlockStatement
src/database/migrations/20200410210541_create_contacts.js:2:30
 
-exports.up = function (knex) {
-    return knex.schema.createTable('contacts', function (table) {
-        table.increments('id').primary()
-        table.integer('physicianId')
-            .unsigned()
-            .notNullable()
-            .references('id')
-            .inTable('physicians')
-            .onDelete('CASCADE');
-        table.string('type').notNullable()
-        table.string('contact').notNullable()
-    })
-};
+exports.up = function (knex) {};
 
 exports.down = function (knex) {

[Survived] BlockStatement
src/database/migrations/20200410210541_create_contacts.js:3:65
 
 exports.up = function (knex) {
-    return knex.schema.createTable('contacts', function (table) {
-        table.increments('id').primary()
-        table.integer('physicianId')
-            .unsigned()
-            .notNullable()
-            .references('id')
-            .inTable('physicians')
-            .onDelete('CASCADE');
-        table.string('type').notNullable()
-        table.string('contact').notNullable()
-    })
+    return knex.schema.createTable('contacts', function (table) {})
 };
 

[Survived] StringLiteral
src/database/migrations/20200410210541_create_contacts.js:4:26
 
 exports.up = function (knex) {
     return knex.schema.createTable('contacts', function (table) {
-        table.increments('id').primary()
+        table.increments("").primary()
         table.integer('physicianId')
             .unsigned()

[Survived] BlockStatement
src/database/migrations/20200410210541_create_contacts.js:16:32
     })
 };
 
-exports.down = function (knex) {
-    return knex.schema.dropTable('contacts')
-};
+exports.down = function (knex) {};
 
