[Survived] BlockStatement
src/database/migrations/20200410210640_create_addresses.js:2:30
 
-exports.up = function (knex) {
-    return knex.schema.createTable('addresses', function (table) {
-        table.increments('id').primary()
-        table.integer('physicianId')
-            .unsigned()
-            .notNullable()
-            .references('id')
-            .inTable('physicians')
-            .onDelete('CASCADE');
-        table.string('type').notNullable()
-        table.string('zipcode').notNullable()
-        table.string('state', 2).notNullable()
-        table.string('city').notNullable()
-        table.string('district').notNullable()
-        table.string('street').notNullable()
-        table.string('status').notNullable()
-    })
-};
+exports.up = function (knex) {};
 
 exports.down = function (knex) {

[Survived] BlockStatement
src/database/migrations/20200410210640_create_addresses.js:3:66
 
 exports.up = function (knex) {
-    return knex.schema.createTable('addresses', function (table) {
-        table.increments('id').primary()
-        table.integer('physicianId')
-            .unsigned()
-            .notNullable()
-            .references('id')
-            .inTable('physicians')
-            .onDelete('CASCADE');
-        table.string('type').notNullable()
-        table.string('zipcode').notNullable()
-        table.string('state', 2).notNullable()
-        table.string('city').notNullable()
-        table.string('district').notNullable()
-        table.string('street').notNullable()
-        table.string('status').notNullable()
-    })
+    return knex.schema.createTable('addresses', function (table) {})
 };
 

[Survived] StringLiteral
src/database/migrations/20200410210640_create_addresses.js:8:25
         table.integer('physicianId')
             .unsigned()
             .notNullable()
-            .references('id')
+            .references("")
             .inTable('physicians')
             .onDelete('CASCADE');

[Survived] StringLiteral
src/database/migrations/20200410210640_create_addresses.js:9:22
             .unsigned()
             .notNullable()
             .references('id')
-            .inTable('physicians')
+            .inTable("")
             .onDelete('CASCADE');
         table.string('type').notNullable()

[Survived] StringLiteral
src/database/migrations/20200410210640_create_addresses.js:11:22
             .references('id')
             .inTable('physicians')
             .onDelete('CASCADE');
-        table.string('type').notNullable()
+        table.string("").notNullable()
         table.string('zipcode').notNullable()
         table.string('state', 2).notNullable()

[Survived] StringLiteral
src/database/migrations/20200410210640_create_addresses.js:13:22
             .onDelete('CASCADE');
         table.string('type').notNullable()
         table.string('zipcode').notNullable()
-        table.string('state', 2).notNullable()
+        table.string("", 2).notNullable()
         table.string('city').notNullable()
         table.string('district').notNullable()

[Survived] BlockStatement
src/database/migrations/20200410210640_create_addresses.js:21:32
     })
 };
 
-exports.down = function (knex) {
-    return knex.schema.dropTable('addresses')
-    //return knex.schema.dropTable('addresses')
-};
+exports.down = function (knex) {};
 
