[Survived] BlockStatement
src/database/migrations/20200410210742_create_specialties.js:2:30
 
-exports.up = function (knex) {
-    return knex.schema.createTable('specialties', function (table) {
-        table.increments('id').primary()
-        table.string('name').notNullable()
-        table.boolean('status').notNullable().defaultTo(true)
-    })
-};
+exports.up = function (knex) {};
 
 exports.down = function (knex) {

[Survived] BlockStatement
src/database/migrations/20200410210742_create_specialties.js:3:68
 
 exports.up = function (knex) {
-    return knex.schema.createTable('specialties', function (table) {
-        table.increments('id').primary()
-        table.string('name').notNullable()
-        table.boolean('status').notNullable().defaultTo(true)
-    })
+    return knex.schema.createTable('specialties', function (table) {})
 };
 

[Survived] BooleanLiteral
src/database/migrations/20200410210742_create_specialties.js:6:57
     return knex.schema.createTable('specialties', function (table) {
         table.increments('id').primary()
         table.string('name').notNullable()
-        table.boolean('status').notNullable().defaultTo(true)
+        table.boolean('status').notNullable().defaultTo(false)
     })
 };

[Survived] BlockStatement
src/database/migrations/20200410210742_create_specialties.js:10:32
     })
 };
 
-exports.down = function (knex) {
-    return knex.schema.dropTable('specialties')
-};
+exports.down = function (knex) {};
 

[Survived] StringLiteral
src/database/migrations/20200410210742_create_specialties.js:11:34
 };
 
 exports.down = function (knex) {
-    return knex.schema.dropTable('specialties')
+    return knex.schema.dropTable("")
 };
 
