[Survived] BlockStatement
src/database/migrations/20200410210844_create_physician_specialties.js:2:30
 
-exports.up = function (knex) {
-    return knex.schema.createTable('physician_specialties', function (table) {
-        table.increments('id').primary()
-        table.integer('physicianId')
-            .unsigned()
-            .notNullable()
-            .references('id')
-            .inTable('physicians')
-            .onDelete('CASCADE');
-        table.integer('specialtiesId')
-            .unsigned()
-            .notNullable()
-            .references('id')
-            .inTable('specialties')
-            .onDelete('CASCADE');
-    })
-};
+exports.up = function (knex) {};
 
 exports.down = function (knex) {

[Survived] BlockStatement
src/database/migrations/20200410210844_create_physician_specialties.js:3:78
 
 exports.up = function (knex) {
-    return knex.schema.createTable('physician_specialties', function (table) {
-        table.increments('id').primary()
-        table.integer('physicianId')
-            .unsigned()
-            .notNullable()
-            .references('id')
-            .inTable('physicians')
-            .onDelete('CASCADE');
-        table.integer('specialtiesId')
-            .unsigned()
-            .notNullable()
-            .references('id')
-            .inTable('specialties')
-            .onDelete('CASCADE');
-    })
+    return knex.schema.createTable('physician_specialties', function (table) {})
 };
 

[Survived] StringLiteral
src/database/migrations/20200410210844_create_physician_specialties.js:4:26
 
 exports.up = function (knex) {
     return knex.schema.createTable('physician_specialties', function (table) {
-        table.increments('id').primary()
+        table.increments("").primary()
         table.integer('physicianId')
             .unsigned()

[Survived] StringLiteral
src/database/migrations/20200410210844_create_physician_specialties.js:5:23
 exports.up = function (knex) {
     return knex.schema.createTable('physician_specialties', function (table) {
         table.increments('id').primary()
-        table.integer('physicianId')
+        table.integer("")
             .unsigned()
             .notNullable()

[Survived] StringLiteral
src/database/migrations/20200410210844_create_physician_specialties.js:11:23
             .references('id')
             .inTable('physicians')
             .onDelete('CASCADE');
-        table.integer('specialtiesId')
+        table.integer("")
             .unsigned()
             .notNullable()

[Survived] StringLiteral
src/database/migrations/20200410210844_create_physician_specialties.js:16:23
             .notNullable()
             .references('id')
             .inTable('specialties')
-            .onDelete('CASCADE');
+            .onDelete("");
     })
 };

[Survived] BlockStatement
src/database/migrations/20200410210844_create_physician_specialties.js:20:32
     })
 };
 
-exports.down = function (knex) {
-    return knex.schema.dropTable('physician_specialties')
-};
+exports.down = function (knex) {};
 
