[Survived] BlockStatement
stryker-example/backend/src/index.js:5:36
 
 const app = require("./app");
 
-app.listen(process.env.PORT, () => {
-  console.info(`Running server on port ${process.env.PORT}`);
-});
+app.listen(process.env.PORT, () => {});
 
