[Timeout] StringLiteral
backend/src/routes/index.js:13:14
 const ProfileController = require('../controllers/ProfileController');
 const SpecialtyController = require('../controllers/SpecialtyController');
 
-routes.group("/api", (router) => {
+routes.group("", (router) => {
 
     //Addresses's routes

[Killed] StringLiteral
backend/src/routes/index.js:16:16
 routes.group("/api", (router) => {
 
     //Addresses's routes
-    router.get("/addresses", AddressController.index)
+    router.get("", AddressController.index)
     router.get("/addresses/:id", AddressController.show)
     router.post("/addresses", AddressController.store)

[Survived] StringLiteral
backend/src/routes/index.js:17:16
 
     //Addresses's routes
     router.get("/addresses", AddressController.index)
-    router.get("/addresses/:id", AddressController.show)
+    router.get("", AddressController.show)
     router.post("/addresses", AddressController.store)
     router.put("/addresses/:id", AddressController.update)

[Survived] StringLiteral
backend/src/routes/index.js:19:16
     router.get("/addresses", AddressController.index)
     router.get("/addresses/:id", AddressController.show)
     router.post("/addresses", AddressController.store)
-    router.put("/addresses/:id", AddressController.update)
+    router.put("", AddressController.update)
     router.delete("/addresses/:id", AddressController.destroy)
 

[Killed] StringLiteral
backend/src/routes/index.js:24:16
 
     //Contacts's routes
     router.get("/contacts", ContactController.index)
-    router.get("/contacts/:id", ContactController.show)
+    router.get("", ContactController.show)
     router.post("/contacts", ContactController.store)
     router.put("/contacts/:id", ContactController.update)

[Killed] StringLiteral
backend/src/routes/index.js:26:16
     router.get("/contacts", ContactController.index)
     router.get("/contacts/:id", ContactController.show)
     router.post("/contacts", ContactController.store)
-    router.put("/contacts/:id", ContactController.update)
+    router.put("", ContactController.update)
     router.delete("/contacts/:id", ContactController.destroy)
 

[Survived] StringLiteral
backend/src/routes/index.js:30:16
     router.delete("/contacts/:id", ContactController.destroy)
 
     //Physicians's routes
-    router.get("/physicians", PhysicianController.index)
+    router.get("", PhysicianController.index)
     router.get("/physicians/:id", PhysicianController.show)
     router.post("/physicians", PhysicianController.store)

[Survived] StringLiteral
backend/src/routes/index.js:34:19
     router.get("/physicians/:id", PhysicianController.show)
     router.post("/physicians", PhysicianController.store)
     router.put("/physicians/:id", PhysicianController.update)
-    router.delete("/physicians/:id", PhysicianController.destroy)
+    router.delete("", PhysicianController.destroy)
 
     //PhysicianSpecialty's routes

[Survived] StringLiteral
backend/src/routes/index.js:45:16
 
     //Profiles's routes
     router.get("/profiles", ProfileController.index)
-    router.get("/profiles/:id", ProfileController.show)
+    router.get("", ProfileController.show)
     router.post("/profiles", ProfileController.store)
     router.put("/profiles/:id", ProfileController.update)

[Survived] StringLiteral
backend/src/routes/index.js:51:16
     router.delete("/profiles/:id", ProfileController.destroy)
 
     //Specialties's routes
-    router.get("/specialties", SpecialtyController.index)
+    router.get("", SpecialtyController.index)
     router.get("/specialties/:id", SpecialtyController.show)
     router.post("/specialties", SpecialtyController.store)

[Timeout] StringLiteral
backend/src/routes/index.js:53:17
     //Specialties's routes
     router.get("/specialties", SpecialtyController.index)
     router.get("/specialties/:id", SpecialtyController.show)
-    router.post("/specialties", SpecialtyController.store)
+    router.post("", SpecialtyController.store)
     router.put("/specialties/:id", SpecialtyController.update)
     router.delete("/specialties/:id", SpecialtyController.destroy)

[Killed] StringLiteral
backend/src/routes/index.js:54:16
     router.get("/specialties", SpecialtyController.index)
     router.get("/specialties/:id", SpecialtyController.show)
     router.post("/specialties", SpecialtyController.store)
-    router.put("/specialties/:id", SpecialtyController.update)
+    router.put("", SpecialtyController.update)
     router.delete("/specialties/:id", SpecialtyController.destroy)
 

[Survived] StringLiteral
backend/src/routes/index.js:55:19
     router.get("/specialties/:id", SpecialtyController.show)
     router.post("/specialties", SpecialtyController.store)
     router.put("/specialties/:id", SpecialtyController.update)
-    router.delete("/specialties/:id", SpecialtyController.destroy)
+    router.delete("", SpecialtyController.destroy)
 
 });
